DataProcessors/БП_НазначенияБейджиковПоПравилам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<DataProcessor>
		<Properties>
			<Name>БП_НазначенияБейджиковПоПравилам</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаДокументов</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отладка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроводитьДокументУР</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Критический</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПравилаРасчета</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПравилоНазначенияБейджиков</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.БП_ПравилаНазначенияБейджиков</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Приоритет</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипЦеныРасчета</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТипыЦенНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>НоменклатураПоПравилу</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПравилоРасчетаБейджика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.БП_ПравилаНазначенияБейджиков</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипЦеныРассчитанной</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТипыЦенНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МІСТО</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Поставщик</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>99</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Остаток</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Прибыль</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Приоритет</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаУЦ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РейтингРасчитан</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПравилоРасчета</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПравилаРасчетаЦен_СД</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПрибыльПроцент</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтараяЦена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Поставщики</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Поставщик</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДокументыУР</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДокУР</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.БП_УстановкаРейтингаНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипЦеныРасчета</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТипыЦенНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Бейджики</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Бейджик</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.БП_Бейджики</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПравилоРасчетаБейджика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.БП_ПравилаНазначенияБейджиков</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипЦеныРассчитанной</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТипыЦенНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Приоритет</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УЦ</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>БейджикиСвернута</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипЦеныРассчитанной</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТипыЦенНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>БейджикиТекст</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>1000</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УЦ</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

AccumulationRegisters/Продажи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<AccumulationRegister>
		<Properties>
			<Name>Продажи</Name>
			<Comment>(Упр)</Comment>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Стоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтоимостьБезСкидок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтоимостьПодразделенияОплатаЗатрат</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗаказПокупателя</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетНаОплатуПокупателю</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументПродажи</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВозвратТоваровОтПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомитентуОПродажах</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетОРозничныхПродажах</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомиссионераОПродажах</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриемТовараНаХранение</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Enums/ДаНет_сд.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>ДаНет_сд</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Да</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Нет</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ТипыКонтактнойИнформации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>ТипыКонтактнойИнформации</Name>
			<Comment>(Общ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Адрес</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Телефон</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АдресЭлектроннойПочты</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВебСтраница</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Другое</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

DataProcessors/БП_НазначенияБейджиковПоПравилам/Ext/ObjectModule.bsl
Процедура ЗаполнитьПравила(Критический = Истина) Экспорт 
	Если Отладка тогда
		Сообщить("Заповнення правил призначення бейджиків.");
	КонецЕсли;

	ПравилаРасчета.Очистить();
	
	Запрос_Правила = новый Запрос;
	Запрос_Правила.Текст = "ВЫБРАТЬ
	                       |	БП_ПравилаНазначенияБейджиков.Ссылка КАК ПравилоНазначенияБейджиков,
	                       |	БП_ПравилаНазначенияБейджиков.Приоритет КАК Приоритет,
	                       |	БП_ПравилаНазначенияБейджиков.ВидНоменклатуры,
	                       |	БП_ПравилаНазначенияБейджиков.ТипЦеныРассчитанной КАК ТипЦеныРасчета
	                       |ИЗ
	                       |	Справочник.БП_ПравилаНазначенияБейджиков КАК БП_ПравилаНазначенияБейджиков
	                       |ГДЕ
	                       |	НЕ БП_ПравилаНазначенияБейджиков.ПометкаУдаления
	                       |	И НЕ БП_ПравилаНазначенияБейджиков.НеИспользуется
	                       |	И НЕ БП_ПравилаНазначенияБейджиков.ЭтоГруппа
	                       |	И БП_ПравилаНазначенияБейджиков.Бейджик.Критический = &Критический
	                       |
	                       |УПОРЯДОЧИТЬ ПО
	                       |	Приоритет";   
	
	Запрос_Правила.УстановитьПараметр("Критический",Критический);
	
	Рез_Правила = Запрос_Правила.Выполнить().Выгрузить();
	
	
	ПравилаРасчета.Загрузить(Рез_Правила);
	
КонецПроцедуры	

Процедура  ВыполнитьВсе(ТЗНоменклатура = Неопределено, Критический = Истина) Экспорт 
	
	ДатаДокументов = ТекущаяДата();
	ПроводитьДокументУР = Истина;
	
	ЗаполнитьПравила(Критический); 
	
	Если НЕ ПравилаРасчета.Количество() тогда
		Возврат;
	КонецЕсли;
	
	Если Отладка тогда
		Сообщить("Заповнення номенклатури на основі правил розрахунку цін.");
	КонецЕсли;     
	
	Если ТЗНоменклатура = Неопределено тогда 
		НоменклатураПоПравилу.Загрузить(Обработки.СозданиеУЦ_По_ПравиламРасчета_СД.ПередатьНоменклатуруКРасчетуРейтинга());
	Иначе
		НоменклатураПоПравилу.Загрузить(ТЗНоменклатура);		
	КонецЕсли;
	НазначенияБейджиков();
	СоздатьДокументы();  
	
КонецПроцедуры

Процедура НазначенияБейджиков() Экспорт
	
	Бейджики.Очистить();
	
	Для каждого СтрПравило из ПравилаРасчета цикл
		ПравилоРасчетаБейджика = СтрПравило.ПравилоНазначенияБейджиков;
		Отбор = Новый Структура("ВидНоменклатуры, ТипЦеныРассчитанной", СтрПравило.ВидНоменклатуры, СтрПравило.ТипЦеныРасчета);
		СтрокиНоменклатуры = НоменклатураПоПравилу.НайтиСтроки(Отбор);	
		ИтогоСтрок = СтрокиНоменклатуры.Количество();
			
		Если ПравилоРасчетаБейджика.ПродажыИспользовать тогда
				ТЗПродаж = СформироватьОтчетПродажи(ПравилоРасчетаБейджика.ПродажыНачалоПериода, ПравилоРасчетаБейджика.ПродажыКонецПериода, СтрПравило.ВидНоменклатуры);
		КонецЕсли; 
		//---------------

		//Если ПравилоРасчетаБейджика.ВПИспользовать тогда
		//	ТЗВП = СформироватьОтчетВаловаяПрибыль(ПравилоРасчетаБейджика.ВПНачалоПериода, ПравилоРасчетаБейджика.ВПКонецПериода, СтрПравило.ВидНоменклатуры);
		//КонецЕсли;  
		
		Для каждого СтрНоменклатура из СтрокиНоменклатуры цикл 
			
			Если ПравилоРасчетаБейджика.ВНаличии = СтрНоменклатура.ПравилоРасчета.ВНаличии ИЛИ ПравилоРасчетаБейджика.ВНаличии = Перечисления.ДаНет_сд.ПустаяСсылка() ИЛИ СтрНоменклатура.ПравилоРасчета.ВНаличии = Перечисления.ДаНет_сд.ПустаяСсылка() тогда
				ПроверкаПройдена = Истина;
			Иначе  
				ПроверкаПройдена = Ложь;
			КонецЕсли;    
			
			Если НЕ ПроверкаПройдена тогда
				Продолжить;
			КонецЕсли;    
			
			
						
			Если ПравилоРасчетаБейджика.ПродажыИспользовать  тогда  
				ПроверкаПройдена = Ложь;
				НайденнаяСтрока = ТЗПродаж.Найти(СтрНоменклатура.Номенклатура, "Номенклатура");
				Если НайденнаяСтрока = Неопределено Тогда
					ПроверкаПройдена = Ложь;	
				Иначе
					Если НЕ (НайденнаяСтрока.КоличествоОборот >= ПравилоРасчетаБейджика.ПродажыКоличествоПроданыхС И НайденнаяСтрока.КоличествоОборот <= ПравилоРасчетаБейджика.ПродажыКоличествоПроданыхПо) тогда
						ПроверкаПройдена = Ложь;	
					Иначе  
						НомерСтроки = ТЗПродаж.Индекс(НайденнаяСтрока);
						Если (НомерСтроки >= ПравилоРасчетаБейджика.ПродажыНомерСтрокиС И НомерСтроки <= ПравилоРасчетаБейджика.ПродажыНомерСтрокиПо) тогда
							ПроверкаПройдена = Истина;
						Иначе
							ПроверкаПройдена = Ложь;	
						КонецЕсли;						
					КонецЕсли;
				КонецЕсли;   
				
				Если НЕ ПроверкаПройдена тогда
					Продолжить;
				КонецЕсли; 
			КонецЕсли;			

			
			Если ПравилоРасчетаБейджика.ВПИспользовать тогда  
				ПроверкаПройдена = Ложь;
				//НайденнаяСтрока = ТЗВП.Найти(СтрНоменклатура.Номенклатура, "Номенклатура");
				//Если НайденнаяСтрока = Неопределено Тогда
				//	ПроверкаПройдена = Ложь;	
				//Иначе
				//	Если (НайденнаяСтрока.ВаловаяПрибыль >= ПравилоРасчетаБейджика.ВПБольшеСумма ИЛИ НайденнаяСтрока.Рентабельность >= ПравилоРасчетаБейджика.ВПБольшеПрцент) тогда
				//		ПроверкаПройдена = Истина;	
				//	Иначе  
				//		ПроверкаПройдена = Ложь;						
				//	КонецЕсли;
				//КонецЕсли; 
				//   
				
				Если СтрНоменклатура.ПрибыльПроцент >= ПравилоРасчетаБейджика.ВПБольшеПрцент И СтрНоменклатура.Прибыль >= ПравилоРасчетаБейджика.ВПБольшеСумма тогда
					ПроверкаПройдена = Истина;
				Иначе  
					ПроверкаПройдена = Ложь;
				КонецЕсли; 
				
				Если НЕ ПроверкаПройдена тогда
					Продолжить;
				КонецЕсли;
				
			КонецЕсли;  
			
			Если ПравилоРасчетаБейджика.СтараяЦенаИспользовать тогда  
				
				Если ПравилоРасчетаБейджика.СтараяЦенаЕсть тогда
					ПроверкаПройдена = ?(СтрНоменклатура.СтараяЦена > 0, Истина, Ложь);
				Иначе  
					ПроверкаПройдена = ?(СтрНоменклатура.СтараяЦена = 0, Истина, Ложь);
				КонецЕсли;  
				
				Если НЕ ПроверкаПройдена тогда
					Продолжить;
				КонецЕсли;
				
			КонецЕсли;
		

			Если ПравилоРасчетаБейджика.БУ = Перечисления.ДаНет_сд.Да  тогда
				ПроверкаПройдена = ?(СтрНоменклатура.Номенклатура.БУ, Истина, Ложь);
			ИначеЕсли ПравилоРасчетаБейджика.БУ = Перечисления.ДаНет_сд.Нет тогда 
				ПроверкаПройдена = ?(СтрНоменклатура.Номенклатура.БУ, Ложь, Истина);   
			иначе
				ПроверкаПройдена = Истина;	
			КонецЕсли;
			
			Если НЕ ПроверкаПройдена тогда
				Продолжить;
			КонецЕсли;
			
			ПроверкаПройдена = ПолучитьРейтингПоЗначению(ПравилоРасчетаБейджика.Диаметры, СтрНоменклатура.Номенклатура.ДиаметрДиска);
			Если НЕ ПроверкаПройдена тогда
				Продолжить;
			КонецЕсли;
			ПроверкаПройдена = ПолучитьРейтингПоЗначению(ПравилоРасчетаБейджика.Сезоны, СтрНоменклатура.Номенклатура.Сезонность);
			Если НЕ ПроверкаПройдена тогда
				Продолжить;
			КонецЕсли;
			ПроверкаПройдена = ПолучитьРейтингПоЗначению(ПравилоРасчетаБейджика.ПоставщикиТекст, СтрНоменклатура.Поставщик); 
			Если НЕ ПроверкаПройдена тогда
				Продолжить;
			КонецЕсли;
			ПроверкаПройдена = ПолучитьРейтингПоЗначению(ПравилоРасчетаБейджика.Ширина, СтрНоменклатура.Номенклатура.Ширина);  
			Если НЕ ПроверкаПройдена тогда
				Продолжить;
			КонецЕсли;
			ПроверкаПройдена = ПолучитьРейтингПоЗначению(ПравилоРасчетаБейджика.ВысотаПрофиля, СтрНоменклатура.Номенклатура.ВысотаПрофиля);
			Если НЕ ПроверкаПройдена тогда
				Продолжить;
			КонецЕсли;
			ПроверкаПройдена = ПолучитьРейтингПоЗначению(ПравилоРасчетаБейджика.Номенклатура, СтрНоменклатура.Номенклатура);    
			Если НЕ ПроверкаПройдена тогда
				Продолжить;
			КонецЕсли;
			ПроверкаПройдена = ПолучитьРейтингПоЗначению(ПравилоРасчетаБейджика.ТипыНоменклатуры, СтрНоменклатура.Номенклатура.Тип); 
			Если НЕ ПроверкаПройдена тогда
				Продолжить;
			КонецЕсли;
			ПроверкаПройдена = ПолучитьРейтингПоЗначению(ПравилоРасчетаБейджика.Производители, СтрНоменклатура.Номенклатура.Производитель);  
			Если НЕ ПроверкаПройдена тогда
				Продолжить;
			КонецЕсли;
			ПроверкаПройдена = ПолучитьРейтингПоЗначению(ПравилоРасчетаБейджика.Модели, СтрНоменклатура.Номенклатура.Модель);
			Если НЕ ПроверкаПройдена тогда
				Продолжить;
			КонецЕсли;
			ПроверкаПройдена = ПолучитьРейтингПоЗначению(ПравилоРасчетаБейджика.Города, СтрНоменклатура.МІСТО);  
			Если НЕ ПроверкаПройдена тогда
				Продолжить;
			КонецЕсли;
			ПроверкаПройдена = ПолучитьРейтингПоЗначению(ПравилоРасчетаБейджика.ПоставщикиТекст, СтрНоменклатура.Поставщик);  
			Если НЕ ПроверкаПройдена тогда
				Продолжить;
			КонецЕсли;
			ПроверкаПройдена = ПолучитьРейтингПоЗначению(ПравилоРасчетаБейджика.Модели, СтрНоменклатура.Номенклатура.Модель);
			Если НЕ ПроверкаПройдена тогда
				Продолжить;
			КонецЕсли;
			
			ПроверкаДоговораКонтрагента = Ложь;
			Для каждого СтрДоговор из СтрНоменклатура.ПравилоРасчета.ДоговораКонтрагента цикл
				ПроверкаДоговораКонтрагента = ПолучитьРейтингПоЗначению(ПравилоРасчетаБейджика.ДоговораКонтрагента,СтрДоговор.ДоговорКонтрагента);
				Если ПроверкаДоговораКонтрагента тогда
					Прервать;
				КонецЕсли;
			КонецЦикла;	
			ПроверкаПройдена = ?(НЕ СтрНоменклатура.ПравилоРасчета.ДоговораКонтрагента.Количество(), Истина, ПроверкаДоговораКонтрагента);
			Если НЕ ПроверкаПройдена тогда
				Продолжить;
			КонецЕсли; 
			

			

			
			//Рейтинг = РейтингВНаличии + РейтингСезоны + РейтингНоменклатура + РейтингТипыНоменклатуры + РейтингПроизводители + РейтингМодель + РейтингГорода + РейтингПоставщики + РейтингБУ + РейтингДоговораКонтрагента + РейтингПрибыль + РейтингКоличество;
			
			//Если Отладка тогда
			//	Сообщить("[" + Строка(СтрНоменклатура.НомерСтроки) + "/" + Строка(ИтогоСтрок) + "]. "
			//				+ "Для номенклатури [" + Строка(СтрНоменклатура.Номенклатура) + "] встановлено рейтинг [" + Рейтинг + "]" + ", що складається з наступних показників:  "
			//				+ "наявність товару [" + Строка(РейтингВНаличии) + "], " 
			//				+ "сезоність [" + Строка(РейтингСезоны) + "], "
			//				+ "номенклатура [" + Строка(РейтингНоменклатура) + "], "
			//				+ "тип номенклатури [" + Строка(РейтингТипыНоменклатуры) + "], "
			//				+ "виробник [" + Строка(РейтингПроизводители) + "], "
			//				+ "модель [" + Строка(РейтингМодель) + "], "
			//				+ "місто [" + Строка(РейтингГорода) + "], "
			//				+ "постачальник [" + Строка(РейтингПоставщики) + "], "
			//				+ "б/у [" + Строка(РейтингБУ) + "], "
			//				+ "договора контрагентов [" + Строка(РейтингДоговораКонтрагента) + "]"
			//	            + ?(ПравилоРасчетаРейтинга.НачислятьРейтингЗаПрибыль, ", прибуток [" + Строка(РейтингПрибыль) + "]","")
			//	            + ?(ПравилоРасчетаРейтинга.НачислятьРейтингЗаКоличество, ", кількість [" + Строка(РейтингКоличество) + "]","")
			//				);
			//КонецЕсли;
			
			//СтрНоменклатура.Рейтинг = Рейтинг; 
			СтрНоменклатура.ПравилоРасчетаБейджика = ПравилоРасчетаБейджика;
			//СтрНоменклатура.РейтингРасчитан = Истина;   
			
			
			НовСтрока = Бейджики.Добавить();
			НовСтрока.Бейджик = ПравилоРасчетаБейджика.Бейджик;
			НовСтрока.Номенклатура = СтрНоменклатура.Номенклатура;
			НовСтрока.ПравилоРасчетаБейджика = ПравилоРасчетаБейджика; 
			НовСтрока.ВидНоменклатуры = СтрПравило.ВидНоменклатуры;
			НовСтрока.ТипЦеныРассчитанной = СтрПравило.ТипЦеныРасчета;
			НовСтрока.Приоритет = ПравилоРасчетаБейджика.Приоритет;
			НовСтрока.УЦ = Истина;
		КонецЦикла;
		
	КонецЦикла; 
	
	БейджикиСвернута.Очистить();
	Для каждого Стр из Бейджики цикл            
		НайденнаяСтрока = БейджикиСвернута.Найти(Стр.Номенклатура, "Номенклатура");
		Если НайденнаяСтрока = Неопределено Тогда
			НовСтрока = БейджикиСвернута.Добавить();
			ЗаполнитьЗначенияСвойств(НовСтрока,Стр);
			НовСтрока.БейджикиТекст = Строка(Стр.Бейджик);
		Иначе
			НайденнаяСтрока.БейджикиТекст = ?(ЗначениеЗаполнено(НайденнаяСтрока.БейджикиТекст), НайденнаяСтрока.БейджикиТекст + ", " + Строка(Стр.Бейджик),Строка(Стр.Бейджик));
		КонецЕсли; 	
	КонецЦикла;

КонецПроцедуры   

Функция ПолучитьРейтингПоЗначению(ТЗ,Значение) Экспорт
	
	Если НЕ ТЗ.Количество() тогда
		Возврат Истина;
	КонецЕсли;
	
	НайденнаяСтрока = ТЗ.Найти(Значение, "Значение");
	Если НайденнаяСтрока = Неопределено Тогда
		Возврат Ложь;	
	Иначе
		Возврат Истина;
	КонецЕсли;
	
КонецФункции  

Процедура СоздатьДокументы() Экспорт    
	Если Отладка тогда
		Сообщить("Створення документів Призначення бейджиків номенклатурі.");
	КонецЕсли;
	ДатаДокументаУР = ДатаДокументов;
	
	Бейджики.Сортировать("Бейджик УБЫВ");
	
	ТЗПравилаРасчета = ПравилаРасчета.Выгрузить(,"ВидНоменклатуры,ТипЦеныРасчета");
	ТЗПравилаРасчета.Свернуть("ВидНоменклатуры,ТипЦеныРасчета",);  
	
	Для Каждого Стр_Правило из  ТЗПравилаРасчета Цикл
		//ПравилоНазначенияБейджиков = Стр_Правило.ПравилоНазначенияБейджиков;
		
		СтруктПрав = новый Структура;
		СтруктПрав.Вставить("ТипЦеныРассчитанной", Стр_Правило.ТипЦеныРасчета);
		СтруктПрав.Вставить("ВидНоменклатуры", Стр_Правило.ВидНоменклатуры);
		
		Строки_ПоПравилу = Бейджики.НайтиСтроки(СтруктПрав);
		
		Если Строки_ПоПравилу.Количество() = 0 Тогда 
			Продолжить;
		КонецЕсли;
		
		НовДокументУР = Документы.БП_НазначенияБейджиковНоменклатуры.СоздатьДокумент();
		НовДокументУР.Дата = ДатаДокументаУР;
		НовДокументУР.УстановитьНовыйНомер();
		НовДокументУР.ВидНоменклатуры = Стр_Правило.ВидНоменклатуры;
        НовДокументУР.ТипЦеныРасчета = Стр_Правило.ТипЦеныРасчета;   
		
		Товары = НовДокументУР.Товары;
		Для каждого СтрНом из Строки_ПоПравилу цикл 
			Если НЕ СтрНом.УЦ тогда
				Продолжить;
			КонецЕсли;
			НовСтрока = Товары.Добавить();
			ЗаполнитьЗначенияСвойств(НовСтрока,СтрНом);
		КонецЦикла;                                    
		
		Если ПроводитьДокументУР тогда
			НовДокументУР.Записать(РежимЗаписиДокумента.Проведение);
		Иначе  
			НовДокументУР.Записать(РежимЗаписиДокумента.Запись);
		КонецЕсли;
		
		Сообщить("Успішно створено документ: " + Строка(НовДокументУР.Ссылка));
	КонецЦикла;
		
КонецПроцедуры   

Функция СформироватьОтчетПродажи(ПродажыНачалоПериода, ПродажыКонецПериода, ВидНоменклатуры)
	
	Запрос = Новый Запрос();
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПродажиОбороты.Номенклатура,
	|	СУММА(ПродажиОбороты.КоличествоОборот) КАК КоличествоОборот
	|ИЗ
	|	РегистрНакопления.Продажи.Обороты(&НачПериода, &КонПериода, , Номенклатура.ВидНоменклатуры = &ВидНоменклатуры) КАК ПродажиОбороты
	|
	|СГРУППИРОВАТЬ ПО
	|	ПродажиОбороты.Номенклатура
	|
	|УПОРЯДОЧИТЬ ПО
	|	КоличествоОборот УБЫВ"; 
		
	Запрос.УстановитьПараметр("НачПериода",ПродажыНачалоПериода);
	Запрос.УстановитьПараметр("КонПериода",ПродажыКонецПериода);
	Запрос.УстановитьПараметр("ВидНоменклатуры",ВидНоменклатуры);
	
	ТЗИтог = Запрос.Выполнить().Выгрузить();
	
	Возврат ТЗИтог;
	
	
	Отчет = Отчеты.Продажи.Создать();      
	
	//Отчет.УниверсальныйОтчет.мВыбиратьИмяРегистра = Ложь;
	
	Отчет.УниверсальныйОтчет.ИмяРегистра = "Продажи";
	Отчет.УниверсальныйОтчет.УстановитьНачальныеНастройки(Истина,Неопределено);
	//Отчет.УниверсальныйОтчет.ДобавитьИзмерениеСтроки("Контрагент");
	Отчет.УниверсальныйОтчет.ДобавитьИзмерениеСтроки("Номенклатура");

	// Період
	Отчет.УниверсальныйОтчет.ДатаНач = ПродажыНачалоПериода;
	Отчет.УниверсальныйОтчет.ДатаКон  = ПродажыКонецПериода;
	Отчет.УниверсальныйОтчет.ВыводитьОбщиеИтоги = Ложь;
	Отчет.УниверсальныйОтчет.ВыводитьДетальныеЗаписи = Ложь;  
	Отчет.УниверсальныйОтчет.ПостроительОтчета.ВыводитьДетальныеЗаписи = Ложь;
	Отчет.УниверсальныйОтчет.ПостроительОтчета.ВыводитьОбщиеИтоги = Ложь;	
	//Отчет.УниверсальныйОтчет.ДобавитьОтбор("Номенклатура.ВидНоменклатуры.ТипНоменклатуры", Истина, ВидСравнения.НеРавно, Перечисления.ТипыНоменклатуры.Услуга);
	Отчет.УниверсальныйОтчет.ДобавитьОтбор("Номенклатура.ВидНоменклатуры", Истина, ВидСравнения.Равно, ВидНоменклатуры);
	ТЗИтог = Отчет.УниверсальныйОтчет.ПолучитьРезультат().Выгрузить();  
	
	ТЗИтог.Свернуть("Номенклатура,НоменклатураПредставление,КоличествоОборот"); 
	ТЗИтог.Сортировать("КоличествоОборот Убыв");
	
	Возврат ТЗИтог;
КонецФункции 

Функция СформироватьОтчетВаловаяПрибыль(ВПНачалоПериода, ВПКонецПериода, ВидНоменклатуры)

	Запрос = Новый Запрос();
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВЫРАЗИТЬ(КонтактнаяИнформация.Представление КАК СТРОКА(100)) КАК Телефон,
	|	КонтактнаяИнформация.Объект КАК Контрагент
	|ПОМЕСТИТЬ вт_конт_инф_телефон
	|ИЗ
	|	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	|ГДЕ
	|	КонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ТелефонКонтрагента)
	|	И КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВложенныйЗапрос.Организация КАК Организация,
	|	ВложенныйЗапрос.Проект КАК Проект,
	|	ВложенныйЗапрос.Подразделение КАК Подразделение,
	|	ВложенныйЗапрос.Покупатель КАК Покупатель,
	|	ВложенныйЗапрос.ДоговорПокупателя КАК ДоговорПокупателя,
	|	ВложенныйЗапрос.Номенклатура КАК Номенклатура,
	|	ВложенныйЗапрос.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ВложенныйЗапрос.ЗаказПокупателя КАК ЗаказПокупателя,
	|	ВложенныйЗапрос.Регистратор КАК Регистратор,
	|	ПРЕДСТАВЛЕНИЕ(ВложенныйЗапрос.Организация) КАК ОрганизацияПредставление,
	|	ПРЕДСТАВЛЕНИЕ(ВложенныйЗапрос.Проект) КАК ПроектПредставление,
	|	ПРЕДСТАВЛЕНИЕ(ВложенныйЗапрос.Подразделение) КАК ПодразделениеПредставление,
	|	ПРЕДСТАВЛЕНИЕ(ВложенныйЗапрос.Покупатель) КАК ПокупательПредставление,
	|	ПРЕДСТАВЛЕНИЕ(ВложенныйЗапрос.ДоговорПокупателя) КАК ДоговорПокупателяПредставление,
	|	ПРЕДСТАВЛЕНИЕ(ВложенныйЗапрос.Номенклатура) КАК НоменклатураПредставление,
	|	ПРЕДСТАВЛЕНИЕ(ВложенныйЗапрос.ХарактеристикаНоменклатуры) КАК ХарактеристикаНоменклатурыПредставление,
	|	ПРЕДСТАВЛЕНИЕ(ВложенныйЗапрос.ЗаказПокупателя) КАК ЗаказПокупателяПредставление,
	|	ПРЕДСТАВЛЕНИЕ(ВложенныйЗапрос.Регистратор) КАК РегистраторПредставление,
	|	ВложенныйЗапрос.Период КАК Период,
	|	ВложенныйЗапрос.ПериодДень КАК ПериодДень,
	|	ВложенныйЗапрос.ПериодНеделя КАК ПериодНеделя,
	|	ВложенныйЗапрос.ПериодДекада КАК ПериодДекада,
	|	ВложенныйЗапрос.ПериодМесяц КАК ПериодМесяц,
	|	ВложенныйЗапрос.ПериодКвартал КАК ПериодКвартал,
	|	ВложенныйЗапрос.ПериодПолугодие КАК ПериодПолугодие,
	|	ВложенныйЗапрос.ПериодГод КАК ПериодГод,
	|	ВложенныйЗапрос.Количество КАК Количество,
	|	ВложенныйЗапрос.КоличествоЕдиницОтчетов КАК КоличествоЕдиницОтчетов,
	|	ВложенныйЗапрос.КоличествоБазовыхЕдиниц КАК КоличествоБазовыхЕдиниц,
	|	ВложенныйЗапрос.СтоимостьБезНДС КАК СтоимостьБезНДС,
	|	ВложенныйЗапрос.НДС КАК НДС,
	|	ВложенныйЗапрос.Стоимость КАК Стоимость,
	|	ВложенныйЗапрос.СтоимостьПодразделенияОплатаЗатрат КАК СтоимостьПодразделенияОплатаЗатрат,
	|	ВложенныйЗапрос.Себестоимость КАК Себестоимость,
	|	ВложенныйЗапрос.ВаловаяПрибыль КАК ВаловаяПрибыль,
	|	ВложенныйЗапрос.Эффективность КАК Эффективность,
	|	ВложенныйЗапрос.Рентабельность КАК Рентабельность,
	|	ВложенныйЗапрос.Телефон КАК Телефон
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВложенныйЗапрос.Организация КАК Организация,
	|		ВложенныйЗапрос.Проект КАК Проект,
	|		ВложенныйЗапрос.Подразделение КАК Подразделение,
	|		ВложенныйЗапрос.Покупатель КАК Покупатель,
	|		ВложенныйЗапрос.ДоговорПокупателя КАК ДоговорПокупателя,
	|		ВложенныйЗапрос.Номенклатура КАК Номенклатура,
	|		ВложенныйЗапрос.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|		ВложенныйЗапрос.ЗаказПокупателя КАК ЗаказПокупателя,
	|		ВложенныйЗапрос.Регистратор КАК Регистратор,
	|		ВложенныйЗапрос.Период КАК Период,
	|		НАЧАЛОПЕРИОДА(ВложенныйЗапрос.Период, ДЕНЬ) КАК ПериодДень,
	|		НАЧАЛОПЕРИОДА(ВложенныйЗапрос.Период, НЕДЕЛЯ) КАК ПериодНеделя,
	|		НАЧАЛОПЕРИОДА(ВложенныйЗапрос.Период, ДЕКАДА) КАК ПериодДекада,
	|		НАЧАЛОПЕРИОДА(ВложенныйЗапрос.Период, МЕСЯЦ) КАК ПериодМесяц,
	|		НАЧАЛОПЕРИОДА(ВложенныйЗапрос.Период, КВАРТАЛ) КАК ПериодКвартал,
	|		НАЧАЛОПЕРИОДА(ВложенныйЗапрос.Период, ПОЛУГОДИЕ) КАК ПериодПолугодие,
	|		НАЧАЛОПЕРИОДА(ВложенныйЗапрос.Период, ГОД) КАК ПериодГод,
	|		СУММА(ВложенныйЗапрос.Количество) КАК Количество,
	|		СУММА(ВложенныйЗапрос.КоличествоЕдиницОтчетов) КАК КоличествоЕдиницОтчетов,
	|		СУММА(ВложенныйЗапрос.КоличествоБазовыхЕдиниц) КАК КоличествоБазовыхЕдиниц,
	|		СУММА(ВложенныйЗапрос.СтоимостьБезНДС) КАК СтоимостьБезНДС,
	|		СУММА(ВложенныйЗапрос.НДС) КАК НДС,
	|		СУММА(ВложенныйЗапрос.Стоимость) КАК Стоимость,
	|		СУММА(ВложенныйЗапрос.СтоимостьПодразделенияОплатаЗатрат) КАК СтоимостьПодразделенияОплатаЗатрат,
	|		СУММА(ВложенныйЗапрос.Себестоимость) КАК Себестоимость,
	|		ВЫБОР
	|			КОГДА &НеВключатьНДСВСтоимостьПартий
	|				ТОГДА СУММА(ВложенныйЗапрос.СтоимостьБезНДС)
	|			ИНАЧЕ СУММА(ВложенныйЗапрос.Стоимость)
	|		КОНЕЦ - СУММА(ВложенныйЗапрос.Себестоимость) КАК ВаловаяПрибыль,
	|		100 * ВЫБОР
	|			КОГДА &НеВключатьНДСВСтоимостьПартий
	|				ТОГДА ВЫБОР
	|						КОГДА СУММА(ВложенныйЗапрос.Себестоимость) <> 0
	|							ТОГДА (СУММА(ВложенныйЗапрос.СтоимостьБезНДС) - СУММА(ВложенныйЗапрос.Себестоимость)) / СУММА(ВложенныйЗапрос.Себестоимость)
	|						ИНАЧЕ 0
	|					КОНЕЦ
	|			ИНАЧЕ ВЫБОР
	|					КОГДА СУММА(ВложенныйЗапрос.Себестоимость) <> 0
	|						ТОГДА (СУММА(ВложенныйЗапрос.Стоимость) - СУММА(ВложенныйЗапрос.Себестоимость)) / СУММА(ВложенныйЗапрос.Себестоимость)
	|					ИНАЧЕ 0
	|				КОНЕЦ
	|		КОНЕЦ КАК Эффективность,
	|		100 * ВЫБОР
	|			КОГДА &НеВключатьНДСВСтоимостьПартий
	|				ТОГДА ВЫБОР
	|						КОГДА СУММА(ВложенныйЗапрос.СтоимостьБезНДС) <> 0
	|							ТОГДА (СУММА(ВложенныйЗапрос.СтоимостьБезНДС) - СУММА(ВложенныйЗапрос.Себестоимость)) / СУММА(ВложенныйЗапрос.СтоимостьБезНДС)
	|						ИНАЧЕ 0
	|					КОНЕЦ
	|			ИНАЧЕ ВЫБОР
	|					КОГДА СУММА(ВложенныйЗапрос.Стоимость) <> 0
	|						ТОГДА (СУММА(ВложенныйЗапрос.Стоимость) - СУММА(ВложенныйЗапрос.Себестоимость)) / СУММА(ВложенныйЗапрос.Стоимость)
	|					ИНАЧЕ 0
	|				КОНЕЦ
	|		КОНЕЦ КАК Рентабельность,
	|		вт_конт_инф_телефон.Телефон КАК Телефон
	|	{ВЫБРАТЬ
	|		Организация,
	|		Проект,
	|		Подразделение,
	|		Покупатель,
	|		ДоговорПокупателя,
	|		Номенклатура,
	|		ХарактеристикаНоменклатуры,
	|		ЗаказПокупателя,
	|		Регистратор,
	|		Период,
	|		ПериодДень,
	|		ПериодНеделя,
	|		ПериодДекада,
	|		ПериодМесяц,
	|		ПериодКвартал,
	|		ПериодПолугодие,
	|		ПериодГод}
	|	ИЗ
	|		(ВЫБРАТЬ
	|			ПродажиОбороты.Проект КАК Проект,
	|			ПродажиОбороты.Подразделение КАК Подразделение,
	|			ПродажиОбороты.Контрагент КАК Покупатель,
	|			ПродажиОбороты.ДоговорКонтрагента КАК ДоговорПокупателя,
	|			ПродажиОбороты.Номенклатура КАК Номенклатура,
	|			ПродажиОбороты.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|			ПродажиОбороты.ЗаказПокупателя КАК ЗаказПокупателя,
	|			ПродажиОбороты.Организация КАК Организация,
	|			ПродажиОбороты.Регистратор КАК Регистратор,
	|			ПродажиОбороты.Период КАК Период,
	|			ПродажиОбороты.КоличествоОборот КАК Количество,
	|			ПродажиОбороты.КоличествоОборот * ЕСТЬNULL(ПродажиОбороты.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент, 1) / ЕСТЬNULL(ПродажиОбороты.Номенклатура.ЕдиницаДляОтчетов.Коэффициент, 1) КАК КоличествоЕдиницОтчетов,
	|			ПродажиОбороты.КоличествоОборот * ЕСТЬNULL(ПродажиОбороты.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент, 1) КАК КоличествоБазовыхЕдиниц,
	|			ПродажиОбороты.СтоимостьОборот - ПродажиОбороты.НДСОборот КАК СтоимостьБезНДС,
	|			ПродажиОбороты.НДСОборот КАК НДС,
	|			ПродажиОбороты.СтоимостьОборот КАК Стоимость,
	|			ПродажиОбороты.СтоимостьПодразделенияОплатаЗатратОборот КАК СтоимостьПодразделенияОплатаЗатрат,
	|			ЕСТЬNULL(ТаблицаРегистраПродажиСебестоимость.СтоимостьОборот, 0) КАК Себестоимость
	|		ИЗ
	|			РегистрНакопления.Продажи.Обороты(&ДатаНач, &ДатаКон, Регистратор, Номенклатура.ВидНоменклатуры = &ВидНоменклатуры {(Организация).* КАК Организация, (Проект).* КАК Проект, (Подразделение).* КАК Подразделение, (Контрагент).* КАК Покупатель, (ДоговорКонтрагента).* КАК ДоговорПокупателя, (Номенклатура).* КАК Номенклатура, (ХарактеристикаНоменклатуры).* КАК ХарактеристикаНоменклатуры, (ЗаказПокупателя).* КАК ЗаказПокупателя}) КАК ПродажиОбороты
	|				ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|					ПродажиСебестоимость.Номенклатура КАК Номенклатура,
	|					ПродажиСебестоимость.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|					ПродажиСебестоимость.ЗаказПокупателя КАК ЗаказПокупателя,
	|					ВЫБОР
	|						КОГДА ПродажиСебестоимость.ДокументДвижения <> НЕОПРЕДЕЛЕНО
	|							ТОГДА ПродажиСебестоимость.ДокументДвижения
	|						ИНАЧЕ ПродажиСебестоимость.Регистратор
	|					КОНЕЦ КАК Регистратор,
	|					СУММА(ПродажиСебестоимость.Стоимость) КАК СтоимостьОборот
	|				ИЗ
	|					РегистрНакопления.ПродажиСебестоимость КАК ПродажиСебестоимость
	|				ГДЕ
	|					ПродажиСебестоимость.Период МЕЖДУ &ДатаНач И &ДатаКон
	|					И ПродажиСебестоимость.Номенклатура.ВидНоменклатуры = &ВидНоменклатуры
	|				{ГДЕ
	|					ПродажиСебестоимость.Проект.* КАК Проект,
	|					ПродажиСебестоимость.Подразделение.* КАК Подразделение,
	|					ПродажиСебестоимость.Номенклатура.* КАК Номенклатура,
	|					ПродажиСебестоимость.ХарактеристикаНоменклатуры.* КАК ХарактеристикаНоменклатуры,
	|					ПродажиСебестоимость.ЗаказПокупателя.* КАК ЗаказПокупателя}
	|				
	|				СГРУППИРОВАТЬ ПО
	|					ПродажиСебестоимость.Номенклатура,
	|					ПродажиСебестоимость.ХарактеристикаНоменклатуры,
	|					ПродажиСебестоимость.ЗаказПокупателя,
	|					ВЫБОР
	|						КОГДА ПродажиСебестоимость.ДокументДвижения <> НЕОПРЕДЕЛЕНО
	|							ТОГДА ПродажиСебестоимость.ДокументДвижения
	|						ИНАЧЕ ПродажиСебестоимость.Регистратор
	|					КОНЕЦ) КАК ТаблицаРегистраПродажиСебестоимость
	|				ПО (ТаблицаРегистраПродажиСебестоимость.Номенклатура = ПродажиОбороты.Номенклатура)
	|					И (ТаблицаРегистраПродажиСебестоимость.ХарактеристикаНоменклатуры = ПродажиОбороты.ХарактеристикаНоменклатуры)
	|					И (ТаблицаРегистраПродажиСебестоимость.ЗаказПокупателя = ПродажиОбороты.ЗаказПокупателя)
	|					И (ТаблицаРегистраПродажиСебестоимость.Регистратор = ПродажиОбороты.Регистратор)) КАК ВложенныйЗапрос
	|			ЛЕВОЕ СОЕДИНЕНИЕ вт_конт_инф_телефон КАК вт_конт_инф_телефон
	|			ПО ВложенныйЗапрос.Покупатель = вт_конт_инф_телефон.Контрагент
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ВложенныйЗапрос.Организация,
	|		ВложенныйЗапрос.Проект,
	|		ВложенныйЗапрос.Подразделение,
	|		ВложенныйЗапрос.Покупатель,
	|		ВложенныйЗапрос.ДоговорПокупателя,
	|		ВложенныйЗапрос.Номенклатура,
	|		ВложенныйЗапрос.ХарактеристикаНоменклатуры,
	|		ВложенныйЗапрос.ЗаказПокупателя,
	|		ВложенныйЗапрос.Регистратор,
	|		ВложенныйЗапрос.Период,
	|		вт_конт_инф_телефон.Телефон
	|	
	|	ИМЕЮЩИЕ
	|		(СУММА(ВложенныйЗапрос.Количество) <> 0
	|			ИЛИ СУММА(ВложенныйЗапрос.Стоимость) <> 0
	|			ИЛИ СУММА(ЕСТЬNULL(ВложенныйЗапрос.Себестоимость, 0)) <> 0)) КАК ВложенныйЗапрос"; 
		
	Запрос.УстановитьПараметр("ДатаНач",ВПНачалоПериода);
	Запрос.УстановитьПараметр("ДатаКон",ВПКонецПериода); 
	Запрос.УстановитьПараметр("ВидНоменклатуры",ВидНоменклатуры);  
    Запрос.УстановитьПараметр("НеВключатьНДСВСтоимостьПартий",Ложь);  
	
	ТЗИтог = Запрос.Выполнить().Выгрузить();
	
	Возврат ТЗИтог;
КонецФункции  

Функция СформироватьОтчетСтараяЦена(ТипЦен)

	Запрос = Новый Запрос();
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЦеныНоменклатурыСрезПоследних.Номенклатура,
	|	ЦеныНоменклатурыСрезПоследних.Цена
	|ИЗ
	|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(, ТипЦен = &ТипЦен) КАК ЦеныНоменклатурыСрезПоследних"; 
		
	Запрос.УстановитьПараметр("ТипЦен",ТипЦен);
	
	ТЗИтог = Запрос.Выполнить().Выгрузить();
	
	Возврат ТЗИтог;
КонецФункции
